import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';
import { Router } from '@angular/router';
import { ActivatedRoute } from '@angular/router';
import { DescriptionDrone } from '../models/descriptionDrone';



@Component({
  selector: 'app-more-info',
  standalone: true,
  imports: [MoreInfoComponent, CommonModule],
  templateUrl: './more-info.component.html',
  styleUrl: './more-info.component.scss',
})
export class MoreInfoComponent {


  drones: { [key: string]: DescriptionDrone } = {
    sustema_keryvanna: new DescriptionDrone(['A7.jpg'], "Система керування на оптоволокні", "", 
     
      { "Система живлення:": "Напруга: +9 В (червоний провід); Споживана потужність: 1 Вт ",
      "Оптоволоконна система:": "Тип оптоволокна: одномодове (9/125); Діаметр зовнішньої оболонки: 0.2 мм; Довжина патчкорду: до 30 м; Специфікація: FC  ", "Канали управління:": "18 (СН1-18) ",
      "Відео система:": "CVBS (аналоговий)", "Конструктивні характеристики: ": "Матеріал корпусу: PVC, PETO, ABS; Вага: 1 кг; Розміри: Діаметр: 10 см; Довжина: 40 см ", "Сумісність: ": "Пульти: RadioMaster TX12, TX16, Boxer та OpenTX; З окулярами:  з аналоговим входом", "Умови експлуатації: ": "Температура: від -10 °C до +50 °C; Вологість: 10%-90% (без конденсації)",
    }, "Довжина 10 км: 17 420 UAH ", "Довжина 15 км: 24 200 UAH")
    ,
    fpv_dron_10: new DescriptionDrone(['IMG_6500.png'], "FPV дрон 10inc", "Десятидюймовий дрон створений для системи керування на 10 км", 
     
      { "Рама:": "Mark4 ", "Двигуни:": "FlashHobby 3115 900KV ", "Стек :": "speedy bee 60A v4 ", "Камера:": "runcam 1200tvl", "Пропеллери:": " 1050", "Стрепи:": " 2шт", "Батарея:": "6S3P Sumsung",     
      }, "Ціна: 17 600 UAH"),
    
      fpv_dron_13: new DescriptionDrone(['IMG_6502.png'], "FPV дрон 13’ дюймів", "13-тидюймовий дрон створений для системи керування на 15 км.", 
        { "Рама:": "Mark4 ", "Двигуни:": "FlashHobby 3115 900KV ", "Стек :": "speedy bee 60A v4 ", "Камера:": "runcam 1200tvl", "Пропеллери:": " 1050", "Стрепи:": " 2шт", "Батарея:": "6S3P Samsung", 

        },"Ціна: 35 000 UAH" ),
   
      nazemna_stancia: new DescriptionDrone(['A73.jpg'],"Наземна станція","Точна модуляція сигналу: Ефективно протистояти віддаленим сигналам FPV. Ефективне посилення потужності: Генерує бездротові сигнали для перешкоджання сигналам FPV. Компактний дизайн: Підходить для інтеграції в машину. Ви можете налаштувати частотний діапазон і потужність, які ви хочете.", 
        {"Pобоча напруга":"24-28V","Вихідна потужність":"50W (Налаштування підтримки)","Діапазон робочих частот":" 300 ~ 1200 МГц 2.4 ГГц ISM (Налаштування підтримки)","Робочий струм:":"3000mA ±500","RF джоггл:":"SMA (Радіочастотний вихід)","Імпеданс радіочастотного інтерфейсу:":"50","Розмір модуля":"140 * 54 * 20 мм", "Робоча температура:":"-40°C + 80°C (Технічний клас)"

        },"Ціна: 4600 UAH"),
   
      pidsulyvash_potyshnosti50W: new DescriptionDrone(['100WDigitalmodulation.png'], "Цифровий модуляційний підсилювач потужності","Точна модуляція сигналу: Ефективно протистояти віддаленим сигналам FPV. Ефективне посилення потужності: Генерує бездротові сигнали для перешкоджання сигналам FPV. Компактний дизайн: Підходить для інтеграції в машину. Ви можете налаштувати частотний діапазон і потужність, які ви хочете.", 
         {"Pобоча напруга":"24-28V","Вихідна потужність":"50W (Налаштування підтримки)","Діапазон робочих частот":" 700 ~ 1000 МГц 2.4 ГГц ISM (Налаштування підтримки)","Робочий струм:":"3000mA ±500","RF джоггл:":"SMA (Радіочастотний вихід)","Імпеданс радіочастотного інтерфейсу:":"50","Розмір модуля":"155 * 54 * 23 мм", "Робоча температура:":"-40°C + 80°C (Технічний клас)"},
       "Профіль компанії", "Tatusky Technology Co, Ltd","Ми маємо більш ніж десятирічний досвід роботи в якості індивідуальних виробників в галузі протидії БПЛА, підкріплений 6-річним спеціалізованим досвідом. Майже 6 років присвятивши виробництву контр-безпілотників і понад 10 років успішно працюючи за кордоном, ми поставили сотні продуктів по всьому світу. Використовуючи нашу репутацію та потужну присутність у секторі протидії безпілотникам, ми налагодили широке партнерство з компаніями та заводами, що виробляють засоби протидії безпілотникам. Спираючись на накопичений нашою командою десятирічний досвід у сфері технологій протидії безпілотникам та управління проектами, ми надаємо продукти та послуги, адаптовані до мінливих потреб у сфері протидії безпілотникам." ),
    
      modul_zahusty_vid_bpla: new DescriptionDrone(['100WDigitalmodulation.png'], "Модуль радіочастотного підсилювача потужності (GaN)","5.8GHz анти-дрон модуль 50W.Підтримка потужності та частоти налаштування від 300 МГц до 6 ГГц, 10 Вт, 20 Вт, 30 Вт, 40 Вт, 50 Вт, 60 Вт, 70 Вт, 80 Вт, 100 Вт, 150 Вт, 200 Вт. GaN-транзистори більш ефективні. Ефективність за вирахуванням драйвера (споживання потужності на нагрівання) становить близько 55-65%. Фактично, робоча ефективність понад 2,4 ГГц становить 52%, а робоча ефективність нижче 2,4 ГГц - 55%. Однак ефективність роботи LDMOS-модулів становить лише 45%-55%, тому GaN-модулі споживають менше енергії і повільніше генерують тепло. Радіочастотні та моніторингові технічні показники модуля підсилювача потужності передбачають визначення кожного порту модуля, а також форму та структуру модуля.",
        {"Місце походження:":"Гуандун, Китай","Торгова марка:":"TTSK","Частота:":" 5.8GHZ(5725-5850/5700-5850/5700-5900/5700-5800)mhz","Вихідна потужність:":"50W","Налаштування частоти та потужності":"Підтримка","Максимальний коефіцієнт посилення:":"47 дБм","Напруга":"24-32V", "Розмір продукту:":"38 * 112 * 19.5 мм","Вага продукту":"183 g"
          
        }),
      dronshut: new DescriptionDrone(['AntiUAVGPS.png'], "Дронщит 6 каналів 180-220 Вт Анти-БПЛА GPS L1 L2 2.4G 5.8G контр-дрон дронщит Autel Mavic система захисту Gan глушник"," Продукція використовує концепцію інтегрованого виявлення та нанесення удару, інтегруючи виявлення та попередження, пошук цілей, нанесення удару по перешкодах, портативний демонтаж та інші функції. Вони можуть використовуватися окремо або кілька комплектів обладнання можуть використовуватися разом, щоб сформувати мережу для нанесення ударів. Хвостова частина обладнання має візуальну систему управління, яка відображає дані виявлення і статус удару в режимі реального часу. Вона має інтелектуальне розпізнавання і інтегровані функції захисту і підходить для різних індивідуальних сценаріїв виконання завдань, таких як громадська безпека, озброєна поліція, війська і охорона кордонів.",
          {"Канал 1:":"800M","Робоча частота(Настроюється діапазон частот):":"830 ~ 850 МГц","Вихід Потужність (#0.5dBm)":" 40dBm ","Канал 2:":"900M","Робоча частота (Настроюється діапазон частот):":"900 ~ 930 МГц","Вихід Потужність (#0.5dBm) ":"43dBm","Канал 3":"1.2G ", "Робоча частота (Настроюється діапазон частот) :":"1180 ~ 1280 МГц ","Вихід Потужність (#0.5dBm)  ":"43dBm",
            "Канал 4 ":"1.5G ", "Робоча частота (Настроюється діапазон частот): ":"1550 ~ 1620 МГц (GPS)","Вихід Потужність (#0.5dBm) :":"43dBm","Канал 5 ":"2.4G","Робоча частота (Настроюється діапазон частот):  ":"2400 ~ 2500 МГц ","Вихід Потужність (#0.5dBm)  :":"47dBm", "Канал 6 ":"5.2G ", "Робоча частота (Настроюється діапазон частот):   ":"5150~5250МГц", "Вихід Потужність (#0.5dBm)   :":"47dBm", "Канал 7 ":"5.8G ","Робоча частота (Настроюється діапазон частот):    ":"5725~5850МГц ", "Вихід Потужність (#0.5dBm) : ":"47dBm",
            "Режим живлення":"28В, 9Аг", "Час роботи від батареї":"30 ~ 40 хвилин (безперервна робота)", "Робоча температура навколишнього середовища":"від -20°C до +55°C","Діапазон виявлення":"360°", "Дистанція спрацьовування":"≥ 1.5KM", "Відстань виявлення ":"≥ 2KM","Відношення перешкод до зв'язку":"≥ 2:1 (DJI Mavic 3)","Вага (з батареєю)":"≤6KG","Розмір":"397*248*155мм","Загальна вихідна потужність":"220W",
          }, "Функція: інтегрований дизайн, попередження та спрямований удар з покращеними функціями. Портативний: ручна конструкція для одного солдата, легка для перенесення, гнучке розгортання та проста у використанні. Cистема: система повністю функціональна і може використовуватися незалежно, підтримуючи спільне використання оборонних систем. Ергономічність: ергономічний дизайн, міцне зчеплення, можливість підйому, встановлення та використання у фіксованому положенні."),
  
      rykzak_zahusty: new DescriptionDrone(['transformed.png'], "Рюкзак для захисту від безпілотників", "ПОРТАТИВНИЙ ІНТЕГРОВАНИЙ В РЮКЗАК ПРИСТРІЙ ДЛЯ БОРОТЬБИ З БЕЗПІЛОТНИКАМИ. Портативний лічильник безпілотників: Вбудований модуль на 6 сегментів;  Зручний для перенесення;  Може бути всеспрямований запуск; Діапазон протидії 1 ~ 3 км; Специфікація: Повні аксесуари; Хост 1 /Акумулятор 1; Зарядний пристрій 1 комплект; Всеспрямована антена 8; 1 комплект спрямованої антени; 1/ ручка для перенесення напрямна планка(легко переносити). 2/ Водонепроникний матеріал, надійна якість.",
            {"Номер моделі ":"TTSKB06Pro", "Тип":"Рюкзак для захисту від безпілотників","Покриття":"1-2 КМ","Діапазони ":"6 діапазонів","Акумулятор":"Вбудований 20000mah","Розмір":"500 * 300 * 200 мм","Загальна вихідна потужність ":"180W-300w","Вага нетто":"16 кг-18 кг","Версія":" 180W:","Канал":"CH1","Робоча частота":"420-450 МГц", "Вихідна потужність (1 дБм)":"30W", "Канал ":"CH2","Робоча частота ":"925-980 МГц", "Вихідна потужність (1 дБм) ":"30W","Канал  ":"CH3","Робоча частота  ":"1100-1300 МГц", "Вихідна потужність (1 дБм)  ":"30W","Канал   ":"CH4","Робоча частота   ":"1560-1620 МГц", "Вихідна потужність (1 дБм)   ":"30W", "Канал    ":"CH5","Робоча частота    ":"2400-2500 МГц ", "Вихідна потужність (1 дБм)    ":"30W",  "Канал     ":"CH6","Робоча частота     ":"5725-5875 МГц ", "Вихідна потужність (1 дБм)     ":"30W"},),
          
      ryshnuy_detector: new DescriptionDrone(['a_fpv32.png'],"Ручний детектор безпілотників з антеною DF","Він оснащений комплексною платформою керування та контролю безпілотниками для виявлення та раннього попередження безпілотників у реальному часі в межах видимого діапазону, а також точного відображення серійного номера, моделі та місцезнаходження цільового безпілотника. Така інформація, як швидкість, висота, трек і положення пульта дистанційного керування; продукт інтегрує функції виявлення та ідентифікації безпілотників, раннього попередження, позиціонування і відстеження траєкторії польоту. Він невеликий за розміром, легкий за вагою і його легко переносити. Він підходить для різних сценаріїв захисту безпеки на малій висоті.", {"Режим роботи:":"Радіочастотне зондування","Частота:":"2,4 ГГц 5,8 ГГц",
              "Дальність:":"від 1 до 3 км","Живлення:":"Внутрішній акумулятор","Обмеження:":"Націленість лише на DJl нові моделі","Мова:":"Англійська, китайська","Розмір:":"ДхШхВ: 180 мм 80 мм * 50 мм (безантени)","Вага:":"600 г","Екран:":"Сенсорна панель, РК-екран","Спеціальна функція:":"Відстеження траєкторії польоту та визначення місцезнаходження пілота в одному блоці","Час роботи":"4 години (робота при 20°C)"},
              "Особливості:","1) Портативний - Легка вага, невеликий розмір, портативний, ударостійкий та захищений від падінь. 2) Відстеження - відстеження траєкторії руху декількох цілей, з можливістю відображення їх траєкторій польоту різними кольорами.3) Чорно-білий список - позначте чорний і білий список одним клацанням миші, і при виявленні дронів у білому списку тривога не буде видаватися. 4) Точна ідентифікація - Точно визначте серійний номер, модель, позицію, швидкість, висоту, трек і положення пульта дистанційного керування безпілотника. 5) Екологічна безпека - технологія пасивного виявлення використовується для втручання в навколишнє середовище."),
            
      pryhnuvach_FPV: new DescriptionDrone(['pr_FPV.png'], "Пригнічувач FPV","Тип: одночастотний ручний / двочастотний ручний пригнічувач. Частота: Підтримує різні налаштування частоти. Примітка: Антена повинна бути підключена перед початком роботи. Перед увімкненням живлення необхідно підключити антену. Не від'єднуйте антену підчас роботи пристрою. Незалежно від того, використовується пристрій чи ні, будь ласка, заряджайте його раз на півмісяця, щоб забезпечити працездатність акумулятора.", 
        {"Діапазон частот:":"700-1000 МГц + 2,4 ГГц", "Вихідна потужність:":"30 Вт + 30 Вт (45 дБм)","Час роботи:":"50 хвилин","Водонепроникний:":"IP68","Тестер ємності акумулятора:":"РК-екран","Напруга акумулятора:":" 28В 3000mAh","Струм:":"3.2A@28V","Ефективність:":"55%@46дБм", "Робоча температура:":"'-30℃～65℃",
          "Температура зберігання:":"'-40℃～120℃","Робоча вологість:":"＜95%RH","RF ПОРТ:":"N-роз'єм", "Розетка живлення :":"Авіаційний штекер IP68", "Кнопка увімкнення/вимкнення RF:":"Так", "Кнопка РК-екрану:":"Так","Колір:":"Зелений","Матеріал корпусу:":"Алюміній","Розмір корпусу :":"177*85*43мм", "Вага нетто:":"1.2 кг","Встановлення на штатив:":"3/8",
        },"Переваги продукту:", "1. Водонепроникний клас - IP68, що відповідає зовнішньому використанню. 2. Легко переноситься, ультрамалий і ультралегкий, розмір 175 * 85 * 43 мм, а вага 1 кг. 3. Живлення від літієвої батареї, до 50 хвилин. 4. Відстань екранування може досягати більше 1,0 км. 5. Кілька способів використання, носіння на плечі, закріплення на штативі, також закріплення на автомобілі. 6. Швидка зарядка, менше 2 годин.")
          };

  drone: DescriptionDrone = this.drones['drone1'];

  constructor(private route: ActivatedRoute, private router: Router) { }

  ngOnInit(): void {
    // Subscribe to route parameters
    this.route.paramMap.subscribe(params => {
      let d = params.get('drone')!;
      if (d) {
        this.drone = this.drones[d];
      }
      else{
        this.router.navigate(['/index-five']);
      }
    });
  }

  originalOrder = () => 0
}
