import { CommonModule } from '@angular/common';
import { AfterViewInit, Component, OnInit } from '@angular/core';
import { IconsModule } from '../../icons/icons.module';

@Component({
  selector: 'app-services',
  standalone: true,
  imports: [CommonModule, IconsModule],
  templateUrl: './services.component.html',
  styleUrl: './services.component.scss'
})
export class ServicesComponent implements
  OnInit, AfterViewInit {

  constructor() { }

  ngOnInit(): void {
  }
  ngAfterViewInit() {
  }

  serviceData = [
    {
      icon: 'trending-up',
      title: 'Тестування виробів',
      desc: 'Тестуємо кожен дрон на максимальне навантаження, щоб бути впевненим в кожному на 100%. Тест фіксуємо на відео.'
    },
    {
      icon: 'box',
      title: 'Оригінальні комплектуючі',
      desc: 'Працюємо тільки з перевіреними оригінальними запчастинами, не користуємось і вміємо розрізняти підробки.'
    },
    {
      icon: 'compass',
      title: 'Практична упаковка',
      desc: 'Дрони в коробках по 17 штук із встановленими пропами, готові до використання. Мінімум упаковки. По розкиданих коробках з дронів розвідка бачить де фпв пілоти були.'
    },
    {
      icon: 'command',
      title: 'Продуманий дизайн',
      desc: `Максимальне віднесення антен від корпусу мнімізує інтерференцію від електронних компонентів та моторів безпілотника, знижує рівень
    електромагнітних перешкод, що
    покращує якість сигналу, а також,
    сприяє кращому куту огляду і
    менше екрануються елементами
    самого дрона, що сприяє більш
    стабільному та дальньому зв'язку.`
    },

    {
      icon: 'monitor',
      title: 'Сучасні компоненти',
      desc: 'Використовуємо нові, дорожчі чіпи для забезпечення швидшої реакції апарату та максимального збільшення радіусу дії. Використання компонентів відомих перевірених виробників забезпечує тривалу роботу, довший час польоту, більшу дальність зв’язку та кращу стабільність.Це все сприяє загальному підвищенню ефективності та водночас зменшує ризик відмов, адже у омпоненти відомих брендів часто проходять строгий контроль якості.'
    },
  ]

}